app/views/problems/_form.html.erb

SELECT `clients`.* FROM `clients`
---
                           <td><%= form.label :client_id, 'codigo cliente' %></td>
                            <td><%= form.collection_select :client_id, Client.all, :id ,:run %></td>

SELECT `employees`.* FROM `employees`
---
                            <td><%= form.label :employee_id, 'codigo empleado' %></td>
                            <td><%= form.collection_select :employee_id, Employee.all, :id , :run %></td>