app/views/welcome/index.html.erb

SELECT  1 AS one FROM `deeds` WHERE `deeds`.`problem_id` = 1 LIMIT 1
SELECT  `deeds`.* FROM `deeds` WHERE `deeds`.`problem_id` = 1 ORDER BY `deeds`.`id` DESC LIMIT 1
---
                        <td><%= problem.product_code %></td>
                        <% if problem.deeds.any? %>
                           <td><%= problem.deeds.last.created_at.strftime("%d/%m/%Y") %>