app/views/deeds/_form.html.erb

SELECT `employees`.* FROM `employees`
---
                            <td><%= form.label :employee_id, 'codigo empleado' %></td>
                            <td><%= form.collection_select :employee_id, Employee.all, :id , :run %></td>