app/controllers/clients_controller.rb

	def index
		#@clients = Client.all.page params[:page]
		@clients = Client.search(params[:search]).page params[:page]
---
SELECT  `clients`.* FROM `clients` WHERE `clients`.`client_id` = 2 LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `clients`

 	def show
 		@client = Client.find(params[:id])
---
SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 3 LIMIT 1

	def create
		@client = Client.new(client_params)
		if @client.save
---
INSERT INTO `clients` (`run`, `name`, `lastname`, `mother_name`, `created_at`, `updated_at`) VALUES ('1234', 'prueba', 'por', 'web', '2019-01-21 15:45:42', '2019-01-21 15:45:42')

	def edit
		@client = Client.find(params[:id])
---
SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 6 LIMIT 1

	def update
		@client = Client.find(params[:id])
		if @client.update(client_params)
---
SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 3 LIMIT 1
UPDATE `clients` SET `run` = '12', `updated_at` = '2019-01-22 15:10:10' WHERE `clients`.`id` = 3