app/controllers/deeds_controller.rb

SELECT  `problems`.* FROM `problems` WHERE `problems`.`id` = 2 LIMIT 1
INSERT INTO `deeds` (`created_at`, `description`, `updated_at`, `problem_id`, `employee_id`, `deed_date`) VALUES ('2019-02-20 22:11:16', 'testorrrrrrrrrrrr', '2019-02-20 22:11:16', 2, 1, '2019-02-22')
---
	def create
		@problem = Problem.find(params[:problem_id])
		@deed = @problem.deeds.create(deed_params)

SELECT  `problems`.* FROM `problems` WHERE `problems`.`id` = 2 LIMIT 1
SELECT  `deeds`.* FROM `deeds` WHERE `deeds`.`problem_id` = 2 AND `deeds`.`id` = 3 LIMIT 1
DELETE FROM `deeds` WHERE `deeds`.`id` = 3
---
	def destroy
		@problem = Problem.find(params[:problem_id])
		@deed = @problem.deeds.find(params[:id])
		@deed.destroy