app/controllers/employees_controller.rb

SELECT `employees`.* FROM `employees`
---
	def index
		@employees = Employee.all

SELECT  `employees`.* FROM `employees` WHERE `employees`.`id` = 0 LIMIT 1
---
	def show
		@employee = Employee.find(params[:id])

INSERT INTO `employees` (`run`, `name`, `lastname`, `mother_name`, `charge`, `created_at`, `updated_at`) VALUES ('123', 'prueba', 'para', 'editar', 'webss', '2019-01-21 14:53:18', '2019-01-21 14:53:18')
---
	def create
		@employee = Employee.new(employee_params)

		if @employee.save

SELECT  `employees`.* FROM `employees` WHERE `employees`.`id` = 2 LIMIT 1
---
    def edit
    	@employee = Employee.find(params[:id])

SELECT  `employees`.* FROM `employees` WHERE `employees`.`id` = 3 LIMIT 1
UPDATE `employees` SET `run` = '213', `name` = 'qwqe', `lastname` = 'qwewqe', `mother_name` = 'qweq', `charge` = 'qweqw', `updated_at` = '2019-01-25 21:56:43' WHERE `employees`.`id` = 4
---
	def update
		@employee = Employee.find(params[:id])
		if @employee.update(employee_params)