app/controllers/problems_controller.rb

SELECT COUNT(*) FROM `problems`
SELECT  `problems`.* FROM `problems` WHERE (id Like '%1#%') LIMIT 1
---
	def index
		  @problems = Problem.search(params[:search]).page params[:page]

SELECT  `problems`.* FROM `problems` WHERE `problems`.`id` = 1 LIMIT 1
---
	def show
		@problem = Problem.find(params[:id])

SELECT  `problems`.* FROM `problems` WHERE `problems`.`id` = 1 LIMIT 1
---
	def edit
		@problem =  Problem.find(params[:id])

INSERT INTO `problems` (`created_at`, `document_type`, `document_number`, `buy_at`, `product_code`, `updated_at`, `client_id`, `employee_id`) VALUES ('2019-01-27 22:21:35', 'factura', 12133, '2019-01-23', 12344, '2019-01-27 22:21:35', 4, 4)
---
    def create
    	@problem = Problem.new(problem_params)
    	if @problem.save

SELECT  `problems`.* FROM `problems` WHERE `problems`.`id` = 2 LIMIT 1
UPDATE `problems` SET `document_type` = 'boleta', `buy_at` = '2019-01-15', `updated_at` = '2019-01-22 02:16:12' WHERE `problems`.`id` = 2
---
   	def update
   		@problem = Problem.find(params[:id])
   		if @problem.update(problem_params)

SELECT  `problems`.* FROM `problems` WHERE `problems`.`id` = 1 LIMIT 1
UPDATE `problems` SET `finished` = TRUE, `finished_at` = '-4712-01-01', `updated_at` = '2019-01-29 18:51:31' WHERE `problems`.`id` = 1
INSERT INTO `deeds` (`created_at`, `description`, `updated_at`, `problem_id`, `employee_id`) VALUES ('2019-01-29 19:12:39', 'cerrada', '2019-01-29 19:12:39', 1, 1)
---
    def finish
      @problem = Problem.find(params[:id])
      @problem.finished = true
      @problem.finished_at = Time.new
      @problem.save
      @deed = @problem.deeds.build(:description => "cerrada", :employee_id => @problem.employee_id)
      @deed.save