app/models/client.rb

def self.search(search)
	if search
		Client.where(run: search).or(Client.where("CONCAT_WS(' ', name, lastname) LIKE ?", "%#{search}%"))
---
SELECT  `clients`.* FROM `clients` WHERE `clients`.`run` = '' LIMIT 1