app/models/problem.rb

SELECT `problems`.* FROM `problems` WHERE `problems`.`id` = 123
SELECT `clients`.* FROM `clients` WHERE `clients`.`run` = '123'
SELECT `clients`.`id` FROM `clients` WHERE `clients`.`run` = '1111-1'
---
def self.search(search)
	if search
		if	Problem.where(id: search).present?
			Problem.where(id: search)
			#.or(Problem.joins(:client).where("client.run = ?","%#{search}%"))
		elsif Client.where(run: search).present?
			c = Client.where(run: search).pluck(:id)